# Exercises for 5_th grade
Exercises_5=[
"""
16սմ կողմի երկարություն ունեցող քառակուսին տրոհեցին 4 սմ կողմի երկարություն ունեցող փոքր քառակուսիների: Ապա ստացված քառակուսիներից սարքեցին ուղղանկյուն, որի լայնությունը 8սմ է: Որքա՞ն է ուղղանկյան երկարությունը:

"""
,
"""
Ռոբերտը մտապահել է 4 բնական թիվ, որոնց գումարը 99 է։ Բանից պարզվում է, որ եթե այդ թվերից մեկը փոքրացնեն 2-ով, մյուսը մեծացնեն 2-ով, երրորդը փոքրացնեն 2 անգամ, իսկ չորրորդը մեծացնեն 2 անգամ, ապա ստացված բնական թվերի գումարը միևնույնն է կմնա 99։ Ի՞նչ թվեր կարող էր մտապահած լինել Ռոբերտը։
"""
,
"""
Դնչիկից Վինի Թուխի տուն ճանապարհին մեկը մյուսի հետևից աճում էին 16 երիցուկ և 15 կակաչ: Դնչիկը Թուխին հյուր գնալու ճանապարհին հերթով ջրում էր բոլոր ծաղիկները: Սակայն ջուրը վերջացավ 12-րդ երիցուկը ջրելիս: Հաջորդ օրը Թուխը Դնչիկին հյուր գանլիս հերթով քաղում էր ծաղիկներ: Քաղելով 7 ծաղիկ, նա մտածեց, որ այդքանը բավարար է փունջի համար: Քանի՞ չջրված ծաղիկ մնաց ճանապարհին:
"""
,
"""
Ուսուցիչն Անգետիկին հարցնում է, թե 1-ից մինչև ո՞ր թվերն են գրված գրատախտակին: Անգետիկը հերթով հաշվում է գրատախտակին գրված բոլոր թվանշանները և պատասխանում՝ 55: Ի՞նչ պետք է պատասխաներ Անգետիկն իրականում:
"""
,
"""
1մ կողմի երկարություն ունեցող խորանարդը տրոհեցին 4սմ կողմի երկարություն ունեցող խորանարդիկների: Կբավականացնե՞ն արդյոք այդ խորանարդիկները բզեզին աշխարհի ամենաբարձր շինության տանիք հասնելու համար (Բուրջ Խալիֆա, Դուբայ, բարձրությունը՝ 828մ)
"""
,
"""
16սմ կողմի երկարություն ունեցող քառակուսին տրոհեցին 4 սմ կողմի երկարություն ունեցող փոքր քառակուսիների: Ապա ստացված քառակուսիներից սարքեցին ուղղանկյուն, որի լայնությունը 8սմ է: Որքա՞ն է ուղղանկյան երկարությունը:
"""
,
"""
Քանի՞ թվանշան է օգտագործվում
ա) 1-ից 579
բ) 125-ից 3245
թվերը գրելիս:
"""
,
"""
Մեկ մետր կողմի երկարություն ունեցող խորանարդը տրոհեցին 1սմ կողմի երկարությամբ խորանարդիկների ու ստացված խորանարդիկները շարեցին իրար կողք: Ի՞նչ երկարության շարք ստացվեց:
"""
,
"""
Գտնել երեք հատ իրարից տարբեր անկրճատելի կանոնավոր կոտորակներ, որոնց գումարը բնական թիվ է, իսկ նրանց հակադարձների գումարը ևս բնական թիվ է:
"""
,
"""
Արմենն ունի 2/3 մետր երկարությամբ պարան, բայց չունի քանոն: Արմենին օգնեք կտրել կես մետր երկարությամբ պարան:
"""
,
"""
Արմենը Կարենից 13 հատով ավելի մանդարին ունի: Նա իր մանդարիններից 3 հատը տվեց Կարենին: Այժմ Արմենը Կարենից քանի՞ հատով ավել մանդարին ունի:
"""
,
"""
Առաջին բանվորն աշխատել է 4 օր, օրական 7 ժամ, իսկ երկրորդ բանվորն աշխատել է 3 օր, օրական 8 ժամ: Նրանք միասին պատրաստել են 416 հատ դետալ, ընդ որում նրանք աշխատում են նույն արագությամբ: Պարզել, թե քանի՞ դետալ է պատրաստել առաջին բանվորը:
"""
,
"""
Առաջին պահեստում երկու անգամ ավելի շատ քարածուխ կա, քան երկրորդ պահեստում: Երբ առաջին պահեստ բերեցին 50տ, իսկ երկրորդ պահեստ 125տ քարածուխ, ապա երկու պահեստներում եղած քարածուխերի քանակը հավասարվեց: Պարզել, թե քանի՞ տ քարածուխ դարձավ երկու պահեստներում միասին:
"""
,
"""
Արեգն իր մտապահած թիվը բազմապատկեց 3-ով, ստացված թվին գումարեց 7 ու արդյունքը բաժանելով 2-ի ստացավ 20: Գտնել Արեգի մտապահած թիվը:
"""

]



# Exercises for 6_th grade
Exercises_6=[
"""
Մեկ մետր կողմի երկարություն ունեցող խորանարդը տրոհեցին 1սմ կողմի երկարությամբ խորանարդիկների ու ստացված խորանարդիկները շարեցին իրար կողք: Ի՞նչ երկարության շարք ստացվեց:
"""
,
"""
Գտնել երեք հատ իրարից տարբեր անկրճատելի կանոնավոր կոտորակներ, որոնց գումարը բնական թիվ է, իսկ նրանց հակադարձների գումարը ևս բնական թիվ է:
"""
,
"""
Արմենն ունի 2/3 մետր երկարությամբ պարան, բայց չունի քանոն: Արմենին օգնեք կտրել կես մետր երկարությամբ պարան:
"""
,
"""
Քանի՞ հատ երկնիշ թիվ կա, որ թվանշանների արտադրյալը հավասար է 6
"""
,
"""
Գոռը ծնվել է հուլիսի 11-ին, ընդ որում այդ տարվա հուլիս ամիսն ուներ 5 հատ հինգշաբթի և 4 հատ ուրբաթ: Պարզել, թե շաբաթվա ի՞նչ օր է ծնվել Գոռը:
"""
,
"""
Գտնել
1234567891011121314151617181920212223…
հաջորդականության մեջ 88-րդ դիրքում գրված թվանշանը
"""
,
"""
Քանի՞ քառանիշ թիվ կա, որոնց գրառման մեջ միայն կենտ թվանշաններ են և հարևան թվանշանները չեն կրկնվում:
"""
,
"""
Երկու բրիգադ միասին դաշտը հնձում են 8 օրում: Եթե սկզբում 2 օր աշխատի միայն առաջին բրիգադը, իսկ հետո 5օր աշխատի միայն երկրորդ բրիգադը, ապա կմնա հնձելու դաշտի 58 մասը: Քանի՞ օրում դաշտը կհնձի նրանցից յուրաքանչյուրը:
"""
,
"""
500գրամ ջրից դատարկեցին 100գրամ և տեղը լցրեցին նույնքան աղ: Ստացված լուծույթից եռացրեցին 100գրամ և տեղը լցրեցին նույնքան աղ: Պարզել, թե քանի՞ տոկոսանոց լուծույթ ստացվեց:
"""
,
"""
120գ 30%-անոց համաձուլվածքից կտրեցին 40գրամանոց մի կտոր և տեղը լցրեցին 15%-անոց համաձուլվածք: Պարզել, թե քանի՞ տոկոսանոց համաձուլվածք կստացվի:
"""
]



# Exercises for 7_th grade
Exercises_7 = [
"""
Շախմատի տախտակի որոշ վանդակներում շարեցին նավակներ այնպես, որ ցանկացած տողում և ցանկացած սյունակում կա ճիշտ մեկ հատ նավակ: Այնուհետև տախտակը բաժանեցին չորս հատ 4 կողմով քառակուսիների: Ապացուցել, որ վերևի ձախ 4×4 չափանի քառակուսում կա այնքան նավակ, որքան որ ներքևի աջ 4×4 չափանի քառակուսում:
"""
,
"""
A քաղաքից դեպի B շարժվեց ավտոբուսը: Նրա շարժվելուց 30ր անց նույն ուղղությամբ շարժվեց մեքենան, որը 1,1ժ անց վազանցել էր ավտոբուսին և գտնվում էր նրանից 2կմ հեռավորության վրա: Գտնել ավտոբուսի արագությունը, եթե հայտնի է, որ այն 20կմ/ժ-ով ցածր է մեքենայի արագությունից:
"""
,
"""
Գյուղ բերեցին երեք բեռնատար ալյուր: Առաջին վագունում եղած ալյուրի քանակը երկրորդ վագոնում եղած ալյուրի քանակին հարաբերում է ինչպես 114 : 1-ի, իսկ երրորդ վագոնում կա 44տ, որը 24 տոննայով շատ է, քան թե կար առաջին վագոնում: Բերված ալյուրի 25%-ը բաժանեցին երկու հացթուխների, ընդ որում երկրորդ հացթուխին տվեցին առաջին հացթուխի ստացածի 60%-ի չափով: Քանի՞ տոննա ալյուր ստացավ առաջին հացթուխը:
"""
,
"""
Նկարիչն իր աշակերտներին բաժանեց վրձիններ։ Երբ նա փորձեց յուրաքանչյուրին տալ երկուական վրձին, 4 վրձին մնաց սեղանին, իսկ երբ չորսական վրձին բաժանեց, 1 աշակերտ մնաց առանց վրձնի: Քանի՞ աշակերտ ունի նկարիչը:
"""
,
"""
Ապացուցել, որ 20 հատ 50, 200 և 500 դրամանոցներով հնարավոր չէ ստանալ 5000 դրամ:
"""
,
"""
Գտնել երեք հատ իրարից տարբեր անկրճատելի կանոնավոր կոտորակներ, որոնց գումարը բնական թիվ է, իսկ նրանց հակադարձների գումարը ևս բնական թիվ է:
"""
,
"""
Հայտնի է, որ 13%-անոց աղաջրի զանգվածը 20կգ‐ով ավել է 5%-անոց աղաջրի զանգվածից: Նրանց խառնուրդից առաջանում է 10%-անոց աղաջուր: Գտնել ստացված լուծույթի զանգվածը:
"""
,
"""
Եռանկյան անկյուններից մեկը մյուսից 120o‐ով մեծ է: Ապացուցել, որ երրորդ գագաթից տարված եռանկյան կիսորդը երկու անգամ մեծ է նույն գագաթից տարված բարձրությունից:
"""
,
"""
30, 60, 90 աստիճան անկյուններով ուղղանկյուն եռանկյունը բաժանել երեք իրար հավասար եռանկյունների:
"""
,
"""
Դիցուք AC հիմքով ABC հավասարասրուն եռանկյան հիմքի դիմացի անկյունը 30o է, իսկ սրունքների երկարությունը 6 է: Տարված են АВС եռանկյան CD բարձրությունը և BDC եռանկյան DE բարձրությունը: Գտնել ВЕ հատվածի երկարությունը:
"""
]



# Exercises for 8_th grade
Exercises_8 = [
"""
Գտնել ամենափոքր 111...1 տեսքի թիվը, որը բաժանվում է 33...3 (100 հատ) թվի վրա:
"""
,
"""
Կարող է արդյոք հարյուրական 0-ներով, 1-երով և 2-ներով գրված թիվը լինել լրիվ քառակուսի:
"""
,
"""
Գրատախտակին գրված էր 10 հաջորդական թվեր: Երբ ջնջեցին նրանցից մեկը, մնացած թվերի գումարը ստացվեց 2002: Գտնել գրատախտակին գրված թվերը:
"""
,
"""
Հայտնի է, որ
35!=10333147966386144929∗66651337523200000000
Գտնել աստղանիշով փոխարինված թիվը:
"""
,
"""
Ապացուցել, որ երեքհարյուր մեկերից և ինչ-որ քանակի զրոներից կազմված թիվը չի կարող լինել լրիվ քառակուսի:
"""
,
"""
Դիցուք M-ը 1992-անիշ թիվ է, որը բաժանվում է 9-ի: A-ով նշանակենք նրա թվանշանների գումարը: B-ով նշանակենք A-ի թվանշանների գումարը, և C-ով նշանակենք B-ի թվանշանների գումարը: Գտնել C թիվը:
"""
,
"""
ա) Ապացուցել, որ եթե թվի բաժանարարների քանակը կենտ է, ապա այդ թիվը բնական թվի քառակուսի է:
բ) Ապացուցել, որ բնական թվի քառակուսու բաժանարարների քանակը կենտ թիվ է:
"""
,
"""
Նկարագրել բոլոր բնական թվերը, որոնք ունեն հետևյալ քանակությամբ բաժանարարներ և գտնել դրանցից ամենափոքրը.
ա) 9
բ) 12
գ) 8
"""
,
"""
Քանի՞ եղանակով է հնարավոր 8 մարդուց կազմել 3 զույգ:
"""
,
"""
Գտնել 7-ի բաժանվող այն ամենափոքր թիվը, որը 2, 3, 4, 5, 6 թվերի վրա բաժանելիս համապատասխանաբար ստացվում են 1, 2, 3, 4, 5 մնացորդներ։
"""
]



# Exercises for 9_th grade
Exercises_9 = [
"""
Հնարավո՞ր է արդյոք 1-ից մինչև 10 բնական թվերը դասավորել բուրգի գագաթների և կողերի վրա այնպես, որ յուրաքանչյուր հատվածի վրա գրված թիվը հավասար լինի այդ հատվածի ծայրակետերում գրված թվերի միջին թվաբանականին:
"""
,
"""
Շախմատի տախտակի վրա առավելագույնը քանի՞ հատ շախմատի ձի է հնարավոր տեղադրել, որպեսզի նրանցից ցանկացած վեց հատի մեջ գտնվեն իրար հարվածող ձիեր:
"""
,
"""
Ապացուցել, որ ցանկացած a և b բնական թվերի և p պարզ թվի համար abp−bap թիվն առանց մնացորդի բաժանվում է p-ի:
"""
,
"""
Գտնել 10000 թվի զույգ բաժանարարների գումարը:
"""
,
"""
Շախմատի տախտակի յուրաքանչյուր վանդակում դրված է մեկական նավակ: Ամեն քայլի թույլատրվում է տախտակից հեռացնել մեկ նավակ, որը հարվածում է կենտ քանակությամբ նավակների: Պարզել, թե առավելագույնը քանի՞ նավակ է հնարավոր հեռացնել տախտակի վրայից:
"""
,
"""
10 շախմատիստների միջև կազմակերպված մրցաշարն անցկացվեց 9 օրում, ընդ որում ամեն օր շախմատիստները բաժանվեցին 5 զույգերի և խաղացին իրար հետ մեկական անգամ: Մրցաշարի ավարտի բոլոր շախմատիստներն իրար միջև խաղացել էին մեկական անգամ, իսկ խաղերի կեսից ավելին խաղացվել էր միևնույն քաղաքի շախմատիստների միջև: Ապացուցել, որ ամեն օր տեղի է ունեցել հանդիպում նույն քաղաքի շախմատիստների միջև:
"""
,
"""
Ֆուտբոլի մրցաշարին մասնակցեցին 16 թիմ, որի ընթացքում բոլոր թիմերն իրար հետ խաղացին մեկական անգամ: Ամեն հաղթանակի համար շնորհվեց 3 միավոր, ոչ-ոքիի համար 1 միավոր, իսկ պարտության համար 0 միավոր: Թիմը կոչվում է հաջողակ, եթե այն վաստակում է հնարավոր առավելագույն միավորների կեսից ավելին: Գտնել հաջողակ թիմերի առավելագույն հնարավոր քանակը:
"""
,
"""
Ապացուցել, որ երեքհարյուր մեկերից և ինչ-որ քանակի զրոներից կազմված թիվը չի կարող լինել լրիվ քառակուսի:
"""
,
"""
Դիցուք M-ը 1992-անիշ թիվ է, որը բաժանվում է 9-ի: A-ով նշանակենք նրա թվանշանների գումարը: B-ով նշանակենք A-ի թվանշանների գումարը, և C-ով նշանակենք B-ի թվանշանների գումարը: Գտնել C թիվը:
"""
,
"""
Գոյություն ունե՞ն արդյոք 100 հատ քառակուսի եռանդամներ, որոնցից յուրաքանչյուրն ունի 2 հատ իրարից տարբեր արմատներ, իսկ ցանկացած երկու եռանդամների գումարը չունի իրական արմատ:
"""
]




# Exercises for 10_th grade
Exercises_10 = [
"""
Ապացուցել, որ եթե n-րդ կարգի բազմանդամը n+1 տարբեր ռացիոնալ կետերում ընդունում է ռացիոնալ արժեքներ, ապա այն ռացիոնալ գործակիցներով է։
"""
,
"""
Դիցուք տրված է մեկից բարձր կարգի ամբողջ գործակիցներով P բազմանդամը։ Գտնել P բազմանդամի ամբողջ կետում ընդունած արժեքների բազմության մեջ հաջորդական ամբողջ թվերի հնարավոր առավելագույն քանակը։
"""
,
"""
Դիցուք 5×100 չափանի աղյուսակի որոշ վանդակներ ներկած են սև այնպես, որ յուրաքանչյուր վանդակի հարակից (ընդհանուր կողմ ունեցող և իրենից տարբեր) վանդակներից սև է ոչ ավել քան երկու հատը։ Գտնել սև վանդակների հնարավոր առավելագույն չափը։
"""
,
"""
Խաչիկն ու Վաչիկը խաղ են խաղում։ Տրված 7×7 չափանի սպիտակ տախտակ։ Խաչիկը կարող է տախտակի որոշ վանդակներ ներկել սև։ Այնուհետև նա սենյակից դուրս է գալիս և Վաչիկը կարող է տախտակի վրա դնել 2×2 չափանի սպիտակ կիսաթափանցիկ պատկեր, որը տակ գտնվող սպիտակ վանդակները կրկին կերևան սպիտակ, իսկ սև վանդակները կդառնան մոխրագույն։ Դրանից հետո Խաչիկը վերադառնում է և պետք է ասի, թե արդյո՞ք Վաչիկը դրել է պատկերը և եթե այո, ապա որտեղ։ Պարզել, թե նվազագույնը քանի՞ վանդակ պետք է ներկի Խաչիկը, որպեսզի կարողանա ճիշտ գտնել։
"""
,
"""
Արամը մեկից մեծ a,b,c բնական թվերի համար հաշվեց a+b+c, a+bc, b+ca, c+ab արտահայտությունների արժեքները և որոշակի հերթականությամբ գրեց գրատախտակին: Արդյո՞ք միշտ հնարավոր է վերականգնել a,b,c արժեքները:
"""
,
"""
Դիցուք հարթության վրա նշված են երկուսից ավելի կետեր, ընդ որում նրանցից ոչ մի երեքը չեն գտնվում նույն ուղղի վրա։ Ապացուցել, որ գոյություն ունի այդ կետերից երեքով անցնող շրջանագիծ, որի ներքին տիրույթում նշված կետ չկա։
"""
,
"""
Ապացուցել, որ գոյություն ունեն 1000 հատ հաջորդական բնական թվեր, որոնցից պարզ են ճիշտ 5 հատը:
"""
,
"""
Կանոնավոր n-անկյան կողմերից երկուսը ներկած են կարմիր, իսկ մյուսները կապույտ: Քանի՞ եղանակով է հնարավոր այն n−3 հատ անկյունագծով տրոհել n−2 հատ եռանկյան այնպես, որ յուրաքանչյուր եռանկյուն պարունակի գոնե մեկ կապույտ կողմ:
"""
,
"""
Գոյություն ունե՞ն արդյոք 16 հատ եռանիշ բնական թվեր, որոնք բոլորով միասին ունեն 3 տարբեր թվանշաններ և նրանք բոլորը 16-ի բաժանելիս տալիս են զույգ առ զույգ իրարից տարբեր մնացորդներ:
"""
,
"""
Դիցուք շրջանագծի երկայնքով գրված են 2018 հատ թվեր, որոնցից յուրաքանչյուրը հավասար է +1 կամ −1: Նարեկը հաշվեց իրար կողք գրված թվազույգերի արտադրյալների գումարը, իսկ Կարենը հաշվեց շրջանագծի երկայնքով գրված բոլոր թվերի գումարը: Գտնել Կարենի ստացած թվի բոլոր հնարավոր արժեքները, եթե հայտնի է, որ Նարեկի ստացած թիվը բացասական է:
"""

]




# Exercises for 11 and 12  grade
Exercises_11_12 = [
"""
Ուղղանկյունը կոչվում է զույգ, եթե նրա բոլոր կողմերի երկարությունները զույգ թվեր են։ Դիցուք տրված է n կենտ թիվը և n×n քառակուսին տրոհված է զույգ ուղղանկյունների և մեկ վանդականոց քառակուսիների։ Գտնել մեկ վանդականոց քառակուսիների հնարավոր նվազագույն քանակը։
"""
,
"""
Դիցուք S-ը մեկից մեծ բնական թվերի վերջավոր բազմություն է։ Հայտնի է, որ ցանկացած n բնական թվի համար գոյություն ունի s∈S բնական թիվ, որի համար (s,n)=1 կամ (s,n)=s: Ապացուցել, որ գոյություն ունեն s,t∈S բնական թվեր, որոնց համար (s,t)-ն պարզ թիվ է։
"""
,
"""
Բնակավայրը բաղկացած է 8×8 աղյուսակի ձևով բաշխված 64 հողամասերից, ընդ որում, հողամասերի սահմաններն ուղղված են դեպի հյուսիս, հարավ, արևելք ու արևմուտք։ Յուրաքանչյուր հողամասում կարող է լինել միայն մեկ տուն, իսկ յուրաքանչյուր տուն կարող է գտնվել միայն մեկ հողամասում։ Տունը կոչվում է արևկող, եթե նրա հարավային, արևելյան և արևմտյան հարևան հողամասերից գոնե մեկում կա դատարկ հողամաս։ Ամենաշատը քանի՞ տուն է հնարավոր կառուցել, որ բոլորն էլ լինեն արևկող։
"""
,
"""
Դիցուք գրատախտակին գրված են բնական թվեր, որոնց քանակը երկուսից շատ է։ Քայլը կայանում է այդ ցուցակից որևէ երեք a,b,c թվեր ընտրելուն, որոնցով հնարավոր է կազմել ոչ հավասարակողմ եռանկյուն և փոխարինել a+b−c, b+c−a և c+a−b թվերով։ Ապացուցել, որ ինչ որ պահից սկսած հնարավոր չի լինի քայլ կատարել։
"""
,
"""
Մաթեմատիկայի մրցույթին մասնակցեցին որոշակի քանակությամբ աշակերտներ։ Աշակերտների որոշակի խումբը կոչվում է թիմ, եթե այդ խմբի ցանկացած երկու աշակերտ իրար հետ ընկերներ են։ Հայտնի է, որ ամենամեծ թիմում աշակերտների քանակը զույգ է։ Ապացուցել, որ մրցույթի մասնակիցներին հնարավոր է բաժանել երկու մասի այնպես, որ այդ մասերում ամենամեծ թիմերում լինեն հավասար քանակությամբ աշակերտներ։
"""
,
"""
Դիցուք d(n,k)-ն n-ի այն բաժանարարների քանակն է, որոնք փոքր չեն k-ից։ Հաշվել գումարը․
d(1001,1)+d(1002,2)+…+d(2000,1000):
"""
,
"""
20182018 բնական թվից հանում են իր թվանշանների գումարի քառապատիկը։ Ստացված թվի հետ կատարում են նույն գործողությունն այնքան ժամանակ, մինչև ստացվի ոչ բնական թիվ։ Գտնել այդ ընթացքում ստացված վերջին բնական թիվը։
"""
,
"""
Դիցուք տրված է ուռուցիկ բազմանկյուն։ Արդյո՞ք միշտ է հնարավոր այն ուղիղ գծով բաժանել երկու բազմանկյունների այնպես, որ նրանք ունենան միևնույն պարագիծը և
ա) բազմանկյունների ամենամեծ կողմերի երկարությունները հավասար են։
բ) բազմանկյունների ամենակարճ կողմերի երկարությունները հավասար են։
"""
,
"""
Դիցուք տրված է P ամբողջ գործակիցներով հաստատունից տարբեր բազմանդամ։ Ապացուցել, որ P բազմանդամի բնական կետերում ընդունած արժեքների պարզ բաժանարարների բազմությունն ընդգրկում է անվերջ քանակությամբ պարզ թվեր։
"""
,
"""
Մաթեմատիկայի օլիմպիադային մասնակցեցին 200 աշակերտ, որի ընթացքում պետք է լուծեին 6 խնդիր։ Հայտնի է, որ յուրաքանչյուր խնդիր ճիշտ է լուծվել առնվազն 120 մասնակցի կողմից։ Ապացուցել, որ կգտնվեն երկու աշակերտ, որոնք միասին լուծել են բոլոր խնդիրները։
"""

]