facts = [
"Տիեզերագնացների սննդի մեծ մասը հեղուկ, ավելի ճիշտ՝ գելային տեսքով է և պահպանվում է ատամի մածուկի տարային նմանվող ամանների մեջ: "
,
"Նախքան տիեզերք թռչելը տիեզերագնացները տարիներ շարունակ իրենց օրգանիզմը ենթարկում են տարատեսակ փորձությունների, որպեսզի ձգողականության բացակայության պայմաններում այն փոփոխությունների ու սթրեսի չենթարկվի: "
,
"Քանի որ տիեզերքում բացակայում է ձգողականության ուժը, տիեզերագնացների ողնաշարը ուղղանում և ձգվում է, ինչի արդյունքում նրանց հասակն ավելանում է մի քանի սանտիմետրով: "
,
"Շատ տիեզերագնացներ Երկիր վերադառնալուց հետո ստիպված են լինում կրկին քայլել սովորել: "
,
"Քանի որ տիեզերագնացների տիեզերքում սովոր են, որ իրերը բաց թողնելիս գետնին չեն ընկնում, Երկիր վերադառնալուց հետո մի որոշ ժամանակ պարբերաբար վայր են գցում ձեռքում պահած իրերը: "
,
"Առաջինը Լուսնի վրա ոտք դրած տիեզերագնացը Նիլ Արմսթրոնգն էր, որը այդ նպատակի իրականացմանը պատրաստվել էր 10 տարի: "
,
"Տիեզերագնացության պատմության ընթացքում ոչ մի տիզերագնաց տիեզերքում չի մահացել: Մահացու ելքով վթարներ, ցավոք, եղել են, սակայն բոլորը եղել են թռիչքների, վայրէջքների կամ փորձարկումների ընթացքում: "
,
"Որոշ տիեզերագնացներ, հայտնվելով անկշռելիության միջավայրում, սկսում են զգալ նույն ախտանշանները, ինչ ծովային հիվանդության ժամանակ՝ հատկապես գլխապտույտ և սրտխառնոց: "
,
"Ամենաերկարը տիեզերքում մնացել է ռուս տիեզերագնաց Գենադի Պադալկան՝ 878 օր: "
,
"Ցավոք, տիեզերքում գտնվելու ընթացքում ոսկորները դառնում են ավելի փխրուն, քանի որ տիեզերագնացները մեծ քանակով կալցիում են կորցնում: "
,
"Ձգողականության բացակայության պայմաններում տիեզերագնացները ստիպված են ատամները լվալուց հետո փրփուրը կուլ տալ, ուստի իրենց ատամի մածուկները պատրաստվում են հատուկ բաղադրությամբ: "
,
"Առաջինը տիեզերանավից բաց տիեզերք է դուրս եկել Գեորգի Գրեչկոն՝ այնտեղ անցկացնելով 23 րոպե 41 վայրկյան, ու հետո դժվարությամբ է կարողացալ ներս մտնել, քանի որ սաղավարտը զգալի ուռել ու մեծացել էր չափերով: "
,
"Իսկ բաց տիեզերքում ամենաշատն անցկացրած ժամանակի ռեկորդը պատկանոպւմ է Անատոլի Սոլովյովին, որն այնտեղ հայտնվել է 16 անգամ՝ ընդհանուր առմամբ 82 ժամ 22 րոպեով: "
,
"Facebook-ի հիմնադիր Մարկ Ցուքերբերգը կարմիր-կանաչ գույների կուրություն ունի և կապույտ գույնը նրա համար ամենահեշտ տեսանելի գույնն է: "
,
"Երբ Լեոնարդո դա Վինչիի հայտնի կտավը՝ «Մոնա Լիզան», գողացան 1911թ.-ին, այն ժամանակ 30-ամյա Պաբլո Պիկասոն կասկածյալներից մեկն էր: Նրան նույնիսկ հարցաքննել են այս գործով: "
,
"Հոլանդիայում ոստիկաններն իրենց հետ խաղալիք արջուկներ են պահում. պատճառն այն է, որ աշխատանքի ժամանակ նրանք կարող են հանդիպել տրավմայի ենթարկված երեխայի: "
,
"Բարբի տիկնիկի ամբողջական անունն է Բարբարա Միլիսենթ Ռոբերթս, իսկ Քենինը՝ Քենեթ Քարսոն: "
,
"Մոտ 2մլրդ մարդ սնվում է միջատներով՝ իր դիետայի շրջանակներում: "
,
"Հին Հունաստանում հավատում էին, որ մարդ կարղ էր գայլի փոխակերպվել, եթե ուտեր մարդու միս: "
,
"Մեր ուղեղը բավական էներգիա է ստեղծում լամպը վառելու համար: "
,
"Կան կատուներ, որոնք ալերգիա ունեն մարդկանցից: "
,
"Եթե ագռավներին վարժեցնեն, ապա նրանք ավելի լավ կկարողանան խոսել, քան թութակները: "
,
"Չերոֆոբիայի՝ վախ հաճույք ստանալուց ու երջանիկ լինելուց: "
,
"Սրտի կաթվածներն ավելի հաճախակի են տեղի ունենում երկուշաբթի օրերին:"
,
"Ինչո՞ւ եք փշաքաղվում։ Փշաքաղվելու փաստը պայմանական բնույթ ունի, օրինակ որոշ կենդանիների սա օգնում է ավելի արագ տաքանալ, յուրաքանչյուր մազ արմատապես առանձին առանձին մեկուսացնելով։ Վտանգի առկայության դեպքում այն պաշտպանողական բնույթ ունի, փշաքաղվելու արդյունքում կենդանիներն ավելի մեծ են թվում, այս կերպ վախ ներշնչելու թշնամուն։ Իհարկե մարդ էլ թշնամուց պաշտպանվելու համար չէ, որ փշաքաղվում է, բայց այն, որ սարսափից այլ հուզական որոշակի վիճակից փշաքաղվում է, ինչու չէ նաև տաքացնում մարմինը, դա անհերքելի փաստ է։ Եւ սա տեղի է ունենում մեր օրգանիզմում առկա ադրենալինի հետևանքով, որն դարեր ի վեր ուղեկցում է համայն մարդկությանը։"
,
"Երբ ծիծաղում են մի խումբ մարդիկ, ապա յուրաքանչյուրը ենթագիտակցորեն նայում է այն մարդուն, ում ամենից շատ է համակրում, կամ այն մարդուն, ում նա կցանկանար համարել իրեն մոտ մարդ:"
,
"Եթե դուք լարված ու հուզված եք, բայց ստիպված եք ինչ-որ կարևոր ու պատասխանատու գործ անել, ապա մաստակ ծամեք կամ ինչ-որ բան կերեք: Քանի որ սննդի ընդունման գործընթացը ենթագիտակցորեն ասոցացվում է ապահովության զգացողության հետ (չէ՞ որ եթե մենք ուտում ենք, ապա մեզ որևէ բան չի սպառնում այդ պահին), այդպես դուք կկարողանաք հանգստանալ և կենտրոնանալ գործի վրա:"
,
"Եթե ինչ-որ մեկը գոռում է ձեզ վրա, պահպանեք հանգստություն: Հնարավոր է՝ այդպես դուք էլ ավելի զայրացնեք ձեր զրուցակցին, սակայն հետագայում նա մեղքի ուժեղ զգացում կապրի իր պահվածքի համար:"
,
"Եթե ձեր զրուցակցի պատասխանը ձեզ դուր չի բավարարում, կամ դուք զգում եք, որ այն լիարժեք չէ, հարցը նորից մի տվեք: Պարզապես ուշադիր նայեք այդ մարդու աչքերին, և նա ստիպված կլինի զրույցը շարունակել այդ թեմայով:"
,
"Պարզվում է՝ ոչ միայն հույզերն են ազդում մեր դիմախաղի վրա, այլև հակառակը: Այնպես որ, եթե ուզում եք ձեզ երջանիկ զգալ, ժպտացեք, որքան հնարավոր է շատ: Արդյունքում դուք կսկսեք ժպտալ միանգամայն անկեղծորեն:"
,
"Նեղոսյան կոկորդիլոսները կարողանում են 2 ժամով պահել շնչառությունը ջրի տակ:"
,
"Հերկուլես բզեզները կարող են մեծանալ մինչև մարդու ձեռքի ափի չափսերի:"
,
"Երկիրի վրա երբևէ ապրած մարդկանց գրեթե կեսը, մահացել են մալարյայից:"
,
"Ամենամեծ ալիքը, որի վրա սահել են մարդիկ՝ եղել է 10 հարկանի շենքի բարձրության:"
,
"Լսողությունը մարդու զգայարաններից ամենաարագն է:"
,
"Քանի որ երկրի առանցքի շուրջ պտույտը դանդաղել է, դինոզավրերի ժամանակաշրջանում օրը տևում էր մոտ 23 ժամ:"
,
"Երկրի երեսին պլաստիկե ֆլամինգոները ավելի շատ են քան կենդանի:"
,
"Ճանապարհի վրա ձվածեղ պատրաստելու համար ասֆալտի ջերմաստիճանը պետք է հասնի 70 oC:"
,
"Այժմ Երկրի վրա ապրող մարդկանցից 53 միլիոնը մեկ տարուց կմահանա:"
,
"Չարլի Չապլինը մի անգամ մասնակցել է Չարլի Չապլինի նմանակների մրցույթին և գրավել 3-րդ տեղը:"
,
" Անտարկտիդան միակ մայրցամաքն է, որտեղ չեն աճեցնում եգիպտացորեն:"
,
"Կրակայրիչների գյուտը շատ ավելի վաղ է, քան լուցկունը:"
,
"Նապոլեոնը ցածրահասակ չէր: Նրա հասակը 170սմ էր, ինչը այն ժամանակ համարվում էր ֆրանսիացու համար միջին հասակ:"
,
"Ցերեկային քնի համար լավագույն ժամը 13:00-ից 14:30 է, քանի որ այդ ժամերին մարմնի ջերմաստիճանը ընկնում է:"
,
"Երեխաները մինչև 4 ամսական չեն զգում աղիությունը:"
,
"Գորտերն ու սալամանդրերը կարող են շնչել մաշկով:"
,
"Խխունջին կպահանջվեր 4575 տարի աշխարհի շուրջ ճամփորդելու համար:"
,
"Կանաչ աչքերը, որոնք հանդիպում են Երկիր մոլորակի մարդկանց ընդամենը 2 տոկոսի մոտ, ավելի շատ տարածված են կանանց մոտ, քան տղամարդկանց և ավելի շատ հանրաճանաչ մարդկանց մոտ, քան հիմնական բնակչության:"
,
"Մարդը իր ամբողջ կյանքում անցնում է 5 հասարակածի երկարությամբ ճանապարհ:"
,
"Գորտերը չեն կարող կուլ տալ առանց թարթելու, որովհետև նրանց աչքի խնձորակները օգնում են կերը հրել ներս:"
,
"Մարդու մաշկը ամբողջությամբ թարմացվում է 28 օրը մեկ:"
,
"Ամենահազվագյուտ քիմիական տարրը հայտնաբերված բնության մեջ կոչվում է Աստատ: Երկրի 1.6կմ հաստությամբ վերին շերտում  պարունակվում է ընդամենը 70մգ Աստատ:"
,
"Ծնոտը մարդու ամենաշատ օգտագործվող մարմնի մասն է:"
,
"Դելֆինները կարող են անվանակոչել մեկմեկու հատուկ ձայնային ազդանշաններով:"
,
"Ամեն օր Երկիր է վերադառնում տիեզերական աղբից գոնե մեկը:"
,
"Բարձի կյանքի միջին տևողությունը 6 տարի է: Դրանից հետո բարձի 10% կազմում են մաշկի մնացորդները, տիզերը և նրանց արտաթորանքները:"
,
"Ամբողջ պատմության ընթացքում մարդկությունը այնքան ոսկի է արդյունահանել, որքանով հնարավոր կլիներ լցնել 2 օլիմպիական լողավազան:"
,
"Ձգողականության ուժի պատճառով ամենամեծ բարձրությունը, որին տեսականորեն կարող են հասնել ծառերը կազմում է 130 մետր:"
,
"Կապույտ կետը իր բերանում կարող է իր քաշին հավասար ծանրություն պահել (իհարկե այդ ամենը ջրի մեջ):"
,
"Աշխարհի ամենաերկար կենդանին ծովային որդն է, որի երկարությունը կարող է հասնել մինչև 55 մետր:"
,
"Երկրի ոսկու 99 %-ը գտնվում է Երկրի միջուկում:"
,
"Կերպարվեստը 1912-1948թթ. պաշտոնապես համարվել է Օլիմպիական խաղերի մարզաձև։"
,
"Վերջին 12 ամիսների ընթացքում արվել է պատմության ընթացքում արված բոլոր լուսանկարների 10%-ը։"
,
"Կենտրոնական Ասիայի ամեն 10-րդ բնակիչը Չինգիզ Խանի տոհմից է։"
,
"Ինքնաթիռի անսարքության պատճառով մահանալու հավանականությունն ընդամենը 3 անգամ է գերազանցում պումայի զոհ դառնալու հավանականությանը։"
,
"Եթե դուք տարեկան աշխատում եք ավելի քան $18.000, ապա մտնում եք մոլորակի ամենահարուստ մարդկանց 4%-ի մեջ։"
,
"Ամեն տարի բժիշկների վատ ձեռագրի պատճառով մահանում է 7000 մարդ, իսկ մոտ 1,5մլն մարդ վնասում է առողջությունը։"
,
"Ադամանդների մեծամասնությունն ավելի քան 3 միլիարդ տարեկան է։"
,
"Մարդկության 40%-ը չի ապրել մինչև 1 տարեկանը լրանալը։"
,
"Նեպտունում ամառը տևում է 40 տարի, սակայն ջերմաստիճանը -200 աստիճան է։"
,
"Ամեն ամիս աշխարհում մահանում է որևէ լեզվի գոնե 2 բարբառ։"
,
"Եթե Երկիր մոլորակը տրամագծով ծակեն, ապա աշխարհի մի ծայրից մյուսը,  այդ անցքի մեջ թռչելով, կարելի է հասնել 42 րոպեի ընթացքում։"
,
"Կիրակի օրը Չինաստանում ավելի շատ մարդ է գնում եկեղեցի, քան ողջ Եվրոպայում։"
,
"Լուսնի փոշին վառոդի հոտ ունի։"
,
"Միջինում ամեն մարդ ավելի քիչ ընկեր ունի, քան իր ընկերներից յուրաքանչյուրը. այդպես էլ առաջացել է ընկերների պարադոքսը։"
]