poems = [
"""
Հովհաննես Թումանյան «Հայրենիքիս հետ»


Վաղուց թեև իմ հայացքը անհայտին է ու հեռվում
Ու իմ սիրտը իմ մտքի հետ անհուններն է թափառում,
Բայց կարոտով ամեն անգամ երբ դառնում եմ դեպի քեզ՝
Մղկտում է սիրտս անվերջ քո թառանչից աղեկեզ,
Ու գաղթական զավակներիդ լուռ շարքերից ուժասպառ,
Ե՛վ գյուղերից, և՛ շեներից՝ տխո՜ւր, դատարկ ու խավար,
Զարկվա՜ծ հայրենիք,
Զրկվա՜ծ հայրենիք։

Խռնվում են մտքիս հանդեպ բանակները անհամար,
Տրորում են քո երեսը, քո դաշտերը ծաղկավառ,
Ու ջարդարար ոհմակները աղաղակով վայրենի,
Ավարներով, ավերներով, խընջույքներով արյունի,
Որ դարձրին քեզ մշտական սև ու սուգի մի հովիտ,
Խեղճ ու լալկան քո երգերով, հայացքներով անժպիտ,
Ողբի՜ հայրենիք,
Որբի՜ հայրենիք։

Բայց հին ու նոր քո վերքերով կանգնած ես դու կենդանի,
Կանգնած խոհո՜ւն, խորհըրդավոր ճամփին նորի ու հընի.
Հառաչանքով սըրտի խորքից խոսք ես խոսում աստծու հետ
Ու խորհում ես խորին խորհուրդ տանջանքներում չարաղետ,
Խորհում ես դու էն մեծ խոսքը, որ պիտի ասես աշխարհքին
Ու պիտ դառնաս էն երկիրը, ուր ձըգտում է մեր հոգին―
Հույսի՜ հայրենիք,
Լույսի՜ հայրենիք։

Ու պիտի գա հանուր կյանքի արշալույսը վառ հագած,
Հազա՜ր-հազար լուսապայծառ հոգիներով ճառագած,
Ու երկնահաս քո բարձունքին, Արարատի սուրբ լանջին,
Կենսաժըպիտ իր շողերը պիտի ժըպտան առաջին,
Ու պոետներ, որ չեն պըղծել իրենց շուրթերն անեծքով,
Պիտի գովեն քո նոր կյանքը նոր երգերով, նոր խոսքով,
Իմ նո՜ր հայրենիք,
Հըզո՜ր հայրենիք․․․
"""
,
"""
Հովհաննես Շիրազ «Իմ սուրբ հայրենիք»


Իմ սուրբ հայրենիք, դու սրտիս մեջ ես,
Դու սրտիս մեջ ես, ոչ լեզվիս վրա,
Իմ սրտի միջից, թե սիրտս ճեղքես՝
Դրոշիդ բոցը պիտի հուրհրա։
Չեմ ուզում գոռալ իմ սիրո մասին,
Սակայն, իմացիր, հայրենի՛ք իմ մեծ,
Քեզ հարյուր տեղով խոցեց թշնամին,
Բայց հազար տեղով իմ սիրտը խոցվեց։
Ես ամբողջովին քոնն եմ, հայրենիք,
Եվ մոմի նման, ճամփեքիդ վրա
Քո փառքի համար թե մի օր վառվեմ,
Մոխրաբիծ անգամ ինձնից չի մնա։
"""
,
"""
Ռուբեն Սևակ «Հոգիս»


Հիվանդ տերեւ մը տեսա կանաչին մեջ դաշտերուն:
Ի՜նչ աղվոր էր գարունը, փափուկ հովեն օրորուն,
Սիրուն խոտերը դաշտին, ծաղիկներն ալ բյուր գույնով,
Կըխնդայի՜ն լռելյայն գաղջ արեւին տաք գինով:

Բայց գարնային կենսավե՜տ այդ պահին մեջ օրորուն
Հիվանդ տերեւ՜ մը տեսա, կանաչին մեջ դաշտերուն,
Չորցած տերեւ՜ մը նիհար, որ զեփյուռին հըպումով
Մեռելամերձ կըդողար մարգերուն մեջ ակնաթով:

Սիրտս անհո՜ւն ցավով լի՝ ես հեռացա սըգահար,
Մատներու մեջ առի զայն ու իր մարմինը նիհար
Գուրգուրանքով, արցունքով մոտեցուցի շըրթունքիս:
Անժամանա՜կ թարշամած գարնան տերեւ մ'է հոգիս.
Ծաղիկներու մեջ կյանքին, զեփյուռին տակ մայիսի,

Ա՛լ ժպտալու անկարող՝ ան կըդողա՜, կըմըսի՜...
"""
,
"""
Պարուր Սևակ «Խենթը»


Ես նայում եմ իմ ձեռքերին,
Ա՛յնպես նայում,
Որ դիտողը ինձ կարող է խենթ համարել:
Նայո՜ւմ-նայո՜ւմ,
Շուռ ու մուռ եմ տալիս այնպե՛ս,
Քարկըտիկ եմ կարծես խաղում առանց քարի:
Ու նրանց հետ խոսում եմ ես
(Նաև խոսո՜ւմ)
Եվ համարրյա նույն լրջությամբ,
Ինչպես Համլետ արքայազնը՝ լերկ գանգի հետ,
Որովհետև... այս ձեռքե՜րը,
Միայն սրա՛նք,Սրա՜նք պիտի լոկ վկայեն,
Թե եղե՞լ ես դու իմ կյանքում,
Ունեցե՞լ եմ երբևէ քեզ,
Զգացե՞լ եմ քեզ՝ համի պես,
Ապրե՞լ եմ քեզ՝ ցավի նման:
Այս ձեռքե՛րը,
Միայն սրա՛նք,
Սրա՜նք պիտի լոկ վկայեն,
Որովհետև...
Ինձ եղածը մտապատրանք է լոկ թվում,
Կարդացած վե՛պ,
Ուրիշ մեկի պատմած երա՜զ:
Ու չեմ հիշում մինչև անգամ քո դեմքը ես.
Տանջում եմ ինձ,
Չեմ ներում ինձ,
Ատում եմ ինձ,
Բայց... չե՜մ հիշում դեմքըդ անգամ:

Միայն սիրված ու համբուրված աչքերը քո,
Ասես քեզնից ընդմիշտ պոկված,
Ուր նայում եմ՝ ինձ են նայում,
Ուր նայում եմ՝ գտնում են ինձ,
Այն Բախտի պես,
Որ դիցապաշտ հին հույներին
Հետևում էր ամբողջ կյանքում...

Անգամ դեմքդ չեմ հիշում ես...
Ու թե հիշեն՝
Միայ՛ն սրանք,
Լոկ ձեռքե՜րըս պիտի հիշեն
Ու վկայեն, որ դու կայի՛ր,
Որ դու եղա՛ր:
Իրո՜ք եղար:
Միայն սրա՛նք պիտի հիշեն
Քո ձևե՛րը,
Մա՛շկը,Հո՛տը,
Սարսո՛ւռը,-
Քեզ՝ ամբողջովի՜ն...

Ու չնայե՞մ իմ ձեռքերին
Ու չնայե՞մ այնպե՛ս, այնքա՛ն,
Որ դիտողը ինձ կարծի... խենթ:

Ու թե կարծի՝ կսխալվի՞...
"""
,
"""
Եղիշե Չարենց «Առավոտ»


Իմ անցած օրերի պես,
Հնացած օրերի պես,
Ես արդեն հեռացել եմ,
Հնացել եմ ես.
Ես արդեն մնացել եմ,
Ես արդեն հիմա ծե՜ր եմ,
Հեռացել ու անցել եմ —
Ծերացել եմ ես։

Բայց այս վառ օրերի մեջ,
Երբ հողմերն աղմկում են,
Աղմկում ու երգում է
Անցած սիրտը իմ.
Ես արդեն հիմա ծե՜ր եմ,
Ինձ կարծես հմայել են,
Եվ իմ սիրտը պահել է
Կրակները հին։ —

Ախ, գիտեմ, որ այդ դո՛ւ ես,
Որ այդպես հմայում ես,
Հմայում ու նայում ես
Օրերում այս հուր.
Դու անուշ կարկաչում ես,
Դու կանչող մի հնչյուն ես,
Կարկաչում ու կանչում ես,
Չգիտեմ, թե ո՞ւր։

Եվ հիմա ես լսում եմ,
Որ վերջին երազում իմ

Քո կարոտն սկսում է
Իմ հոգին հուզել —
Ես կարծես ծերացե՜լ եմ,
Ծերացել ու դարձե՜լ եմ
Ու նորի՜ց երազել եմ
Կարոտանք ու սեր...
"""
,
"""
Եղիշե Չարենց «Դու գնում ես...»


Դու գնում ես, բայց հոգիս սպասում է քեզ.
— Կապո՛ւյտ աղջիկ, քո՛ւյր իմ հեզ, դու հետ չե՞ս գալու

Ես ժպտում եմ, որ երկար ճանապարհին չտրտմես.
Հոգիս մնաց ո՛րբ այնպես — դու հետ չե՞ս գալու...

Դու գնում ես, բայց կարծես կայարան եմ եկել ես,
Որ հանդիպեմ, քույր իմ, քեզ — դու հետ չե՞ս գալու...
"""
,
"""
Վահան Տերյան «Աշնան երգ»


Ցրտահա՜ր, հողմավա՚ր.
Դողացին մեղմաբար
Տերևները դե ղին,
Պատեցին իմ ուղին...

Ճաճանչները թոշնան...
Կանաչներիս աշնան —
Իմ խոհերը մոլար՝
Ցրտահա՜ր, հողմավա՜ր...

Կրակներըս անցան,
Ցուրտ ու մեգ է միայն.
Անուրջներըս երկնածին
Գնացի՜ն, գնացի՜ն...
"""
,
"""
Եղիշե Չարենց «Հեռացումի խոսքեր»


Իմ աչքերի մեջ այնքա՜ն կրակներ եմ մարել ես
Եվ հոգուս մեջ, հուսահատ, այնքան աստղեր եմ մարել:
Կյանքս, որ հուշ է դարձել, հեռանալիս չանիծես.
Կյանքս կանցնի, կմարի – բայց երգս կա, կապրի դեռ:
Կյանքս կանցնի, կմարի, որպես կրակ ճահիճում՝
Աննպատակ ու տարտամ, անմխիթար ու անհույս:
Երգերիս մեջ – դու գիտե՞ս – ինձ ոչ ոք չի ճանաչում՝
Կարծես ուրի՜շն է երգում կապույտ կարոտը հոգուս:
Հավիտյան գոց ու անխոս՝ թափառել եմ ու լռել.
Ոչ ոք, ոչ ոք չգիտե՝ արդյոք ի՞նչ է կյանքս, ես.
Միայն գիտեն, որ կյանքում ինչ-որ երգեր եմ գրել,
Ինչպես գիտեմ, որ դու կաս, որ սիրում է մեկը քեզ:
Ես երգել եմ քո հոգին, քո ժպիտը լուսավոր,
Քո աչքերի, քո դեմքի տխրությունը սրբազան.
Կյանքս թողած անհունում – ես երգել եմ սերը խոր
Ու կարոտը թեւերիս, որ երբե՜ք քեզ չհասան…
Մոտենում է, քո՛ւյր իմ, ա՜խ, իրիկունս միգամած.
Ես ի՞նչ անեմ, որ հոգիս չհեծկլտա կարոտից.
Ինչպե՞ս, ինչպե՞ս ընդունեմ կյանքիս բաժակը քամած,
Որ ձեռքերս չդողան, որ օրերս ներե՜ն ինձ:
ուցե՜ հանկարծ կասկածեմ, չհավատամ ինքս, ես,
Ու սուտ թվա իմ հոգուն քո կարոտը սրբազան…
– Ի՜նչ էլ լինի, քո՛ւյր իմ, քո՛ւյր, հեռանալիս չանիծե՜ս
Խե՜ղճ կարոտը թեւերիս, որ երբե՜ք քեզ չհասան…
"""
,
"""
Շառլ Ազնավուր «Մնա»


Մնա՜, էլի՜ մնա,
Մնա ինձ հետ,
Մարմնիս վրա,
Ձեռքերիս մեջ,
Թևատարա՜ծ,
Բավարարվա՜ծ,
Խենթ ու խելա՜ռ,
Ու հևասպառ:
Մնա սիրով
Ու նվաղած,
Եվ գիշերով
Ցանկապատված,
Սրտիս վրա,
Առանց ամոթ,
Մնա կրքոտ,
Մե՜րկ համարյա:
Այդպե՜ս մնա,
Չհագեցած,
Կյանքիս վրա,
Ձեռքս սեղմած,
Գիսախռիվ,
Մարմնակործա՜ն,
Հե՜զ, անխռո՜վ,
Ու ինքնիշխան:
Այսետղ մնա,
Բառ մի ասա,
Հրճվիր, ցնծա,
Մաշկիս վրա,
Հույսի գրկում
Ու գիշերվա,
Մինչև դրսում,
Լույսը բացվեր,
Իմ սե՜ր, իմ սե՜ր…
"""
,
"""
Եղիշե Չարենց «Տաղ անձնական»

Թողած Կարսում, գետի ափին, տունս՝ շինված անտաշ քարով,
Կարսը թողած, Կարսի այգին ու հայրենի երկինքը մով
Եվ Կարինե Քոթանճյանին անգամ չասած մնաս բարով―
Ա՜նց եմ կենում հիմա օտար քաղաքների ճանապարհով:

Անց եմ կենում, շուրջս-մարդիկ, շուրջս դեմքեր հազա՜ր-հազա՜ր.
Շուրջս աշխարհն է աղմկում, մարդկային կյանքն անհավասար.
Եվ ո՞վ կասի՝ ինչո՞ւ ես դու, և ով կասի, թե ո՞ւր հասար,―
Դեմքերը, ախ, բութ են այնպես՝ կարծես շինված են տապարով:

Գորշ, տաղտկալի ու խելագար երգ է կարծես այս կյանքը մի.
Ինչ-որ մեկի սրտում բացված- վերք է կարծես այս կյանքը մի.
Եվ ո՞ւմ համար- էլ ո՞ւմ համար կարոտակեզ երգե հիմի
Սիրտս՝ լցված տարիների սեղմ արճիճով ու կապարով:
Բայց շուրջս թող որքան կուզե աշխարհը այս խնդա, ցնդի―
Ես- հաշմանդամ ու խելագար ու հավիտյան վտարանդի՜
Դեպի երկինք պիտի գնամ, դեպի եզերքը Ամենտի―
Իմ բարձր, հին ու աստղային երազների ճանապարհով...

Ու էլ ամե'ն մեղքի համար սիրտս հիմա ունի ներում.
Պիտի անդարձ ես հեռանամ, պիտի գնամ՝ ա'չքս հեռուն.
Թե Կարինե Քոթանճյանին տեսնեք Կարսի փողոցներում―
Ասե'ք նրան՝ Չարենցն ասավ- մնաս բարո՜վ, մնաս բարո՜վ...
"""
,
"""
Պարույր Սևակ «Երբ աչքերն են սառում»


Մենակություն բառից դողդողում է օդը իմ սենյակի:
Ու ես հասկանում եմ,
Որ աչքերն են մարդու ամենաթաց տեղը...

...Երբ աչքերն են սառում՝
Ասում են, թե՝ ա՛յ-ա՛յ՝ մարդ է գալու:
Բայց դա եթե սուտ չէ,
Ապա բարություն է,
Որ ծնվել է միայն խեղճությունից:
Իմոնք էլ են սառում:
Սակայն դու չե՜ս գալու:
Դու չե՜ս կարող: Գիտե՜մ:
Եվ օդը սենյակիս
Պիտի շարունակի մենակություն բառից անվերջ դողալ՝
Հարուցելով իմ մեջ այն միտքը հին,
Թե վիհերը գուցե նրա համար են լոկ,
Որ մարդ ներքև նետվի:

Իսկ թե վիհերն իրոք նրա համար են լոկ,
Որ մարդ ներքև նետվի՝
Այդ դեպքում ես
Ինչպե՞ս անեմ.
Կո՛ւժ չեմ,
Կուժկոտրո՜ւկ եմ.
Չե՛մ կոտըրվում, միայն փետըրվո՜ւմ եմ,
Եվ դրանից արդեն ես հոգնել եմ,
Ինչպես թուղթն է հոգնել իմ ջանքերից՝
Հեռվից-հեռու ասել քեզ երկու բառ,
Որ կարող է նո՛ւյնքան ինձ թարգմանել,
Որքան թարգմանում է ինքնաթիռին հավը...

Սուտ կա, որ ճիշտ արժե:
Ու ես հավատում եմ մեր հնարած ստին,
Թե չենք կորցնի իրար:

Վախ կա, որ մահ արժե:
Ու ես վախենում եմ, թե կհաղթի կյանքը,
Եվ կմնամ ցավի խեղճ պատմաբան միայն:

Ու, վերջապես, քայլ կա, որ հենց թռիչք արժե:
Եվ ինձ դուրս եմ քաշում իմ մտքերի միջից,
Ինչպես առողջ ակռան բերանից են քաշում:

Բայց հոգնել եմ արդեն
Եվ հոգնել եմ այնքան,
Որ չեմ զգում ոչի՜նչ,
Ցա՛վ չեմ զգում անգամ:

Ա՜յ թե հնար լիներ չզգալ նաև,
Որ աչքերն են մարդու ամենաթաց տեղը... 
"""
]